# KipFeet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KipFeet Property
UnitTypeId Class See Also
---
Kip feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KipFeet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KipFeet As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KipFeet {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace